Revit 2027 API
SynchronizeWithCentralOptions.RelinquishBorrowedElements Property
 Indicates whether Revit should relinquish borrowed elements after synchronizing with central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RelinquishBorrowedElements { get; }
Public ReadOnly Property RelinquishBorrowedElements As Boolean
	Get
public:
property bool RelinquishBorrowedElements {
	bool get ();
}
member RelinquishBorrowedElements : bool with get
Property Value
Boolean
Remarks
 This is a shortcut to access the value stored in CheckedOutElements.
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace